[


    
    {

        "name": "2020 Apple MacBook Air Laptop: Apple M1 Chip, 13” Retina Display, 8GB RAM, 256GB SSD Storage, Backlit Keyboard, FaceTime HD Camera, Touch ID. Works with iPhone/iPad",
        "category": "Computers",
        "product_id": 1,
        "rating": "4.8 of 5",
        "total_ratings": 13802,
        "original_price": 1050.00,
        "price": 979.00,
        "in_stock": true,
        "main_image": "https://m.media-amazon.com/images/I/71vFKBpKakL._AC_SL1500_.jpg",
        "images": [
            "https://m.media-amazon.com/images/I/71vFKBpKakL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/81HZAfCGZ5L._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/81PeNcC5W4L._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61UVTIkDLuL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71hHMsqVzGL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71zFHzUBzuL._AC_SL1500_.jpg"
        ],


        "about_product": [
            "All-Day Battery Life - Go longer than ever with up to 18 hours of battery life.",
            "Powerful Performance - Take on everything from professional-quality editing to action-packed gaming with ease. The Apple M1 chip with an 8-core CPU delivers up to 3.5x faster performance than the previous generation while using way less power.",
            "Superfast Memory  8GB of unified memory makes your entire system speedy and responsive. That way it can support tasks like memory-hogging multitab browsing and opening a huge graphic file quickly and easily.",
            "Stunning Display - With a 13.3” Retina display, images come alive with new levels of realism. Text is sharp and clear, and colors are more vibrant.",
            "Why Mac - Easy to learn. Easy to set up. Astoundingly powerful. Intuitive. Packed with apps to use right out of the box. Mac is designed to let you work, play, and create like never before.",
            "Simply Compatible - All your existing apps work, including Adobe Creative Cloud, Microsoft 365, and Google Drive. Plus you can use your favorite iPhone and iPad apps directly on macOS. Altogether you'll have access to the biggest collection of apps ever for Mac. All available on the App Store.",
            "Easy to Learn - If you already have an iPhone, MacBook Air feels familiar from the moment you turn it on. And it works perfectly with all your Apple devices. Use your iPad to extend the workspace of your Mac, answer texts and phone calls directly on your Mac, and more.",
            "Fanless Design - Your MacBook Air stays cool and runs quietly even while tackling intense workloads.",
            "AppleCare - Every Mac comes with a one-year limited warranty and up to 90 days of complimentary technical support. Get AppleCare+ to extend your coverage and reduce the stress and cost of unexpected repairs.",
            "Environmentally Friendly - MacBook Air is made with a 100% recycled aluminum enclosure and uses less energy for a smaller carbon footprint."
        ],


        "specifications": [
            "Model Name - MacBook Air",
            "Brand - Apple",
            "Specific Uses For Product - Multimedia, Personal, Business",
            "Screen Size - 13.3 Inches",
            "Operating System - Mac OS",
            "Human Interface Input - Keyboard",
            "CPU Manufacturer -  Apple",
            "Graphics Card Description - Integrated",
            "Color - Gold",
            "Connectivity Technology - Bluetooth, Wi-Fi, Bluetooth 5.0"
        ],
        "options": {
            "capacity": [ "256 GB", "512 GB" ]
        },


        "description_images": [
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/MacBook_Air_Product_Page_L_M1_Chip__en-US_01._CB416881859_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/MacBook_Air_Product_Page_L_M1_Chip__en-US_02._CB416881859_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/MacBook_Air_Product_Page_L_M1_Chip__en-US_03._CB416881859_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/MacBook_Air_Product_Page_L_M1_Chip__en-US_04._CB416881859_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/MacBook_Air_Product_Page_L_M1_Chip__en-US_05._CB416881859_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/MacBook_Air_Product_Page_L_M1_Chip__en-US_06._CB416881859_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/MacBook_Air_Product_Page_L_M1_Chip__en-US_07._CB416881859_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/MacBook_Air_Product_Page_L_M1_Chip__en-US_08._CB416881859_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/MacBook_Air_Product_Page_L_M1_Chip__en-US_09._CB416881859_.jpg"
        ],
        "reviews": [
            {
                "title": "MAKE SURE YOU GET AS MUCH MEMORY & STORAGE AS YOU CAN AFFORD - SPECIAL ORDER IF NEED BE",
                "author": "K. MURPHY",
                "rating": "5.0 of 5",
                "message": "UPDATE 12-15-2020 - After three weeks, I'm still really impressed with the M1 MacBook Air/8 Core CPU/8 Core GPU/512 SSD/8GB RAM. --- My updated plea: MAKE SURE YOU GET AS MUCH MEMORY & STORAGE AS YOU CAN AFFORD. SPECIAL ORDER ONE TO YOUR PROJECTED FUTURE NEED! \n\n Remember, Macs live a very long time and the value it holds will depend on how usable it will be to you or someone else in 5 or even 10 years. Not that long ago, 80 GB hard drives were HUGE... and UPGRADABLE. RAM was upgradable. The SSD and the RAM in these machines is NOT upgradable. \n\n The one issue for me has been that I am a memory hog! I tend to have LOTS of tabs open at once (I've caught myself with 50 (Safari) open in one browser and 39 (Chrome) in another!), while running Affinity/Final Cut Pro - and YES, the dreaded Beach Ball has reared it's ugly head. Well, this got me to assess what I will be using the machine for and for how long. \n\n Storage can be added with external drives, slower, but it will let you scrape by. RAM is another story. When you constantly use up RAM, the system starts using swap memory where it uses the SSD to store temporary files. One of the YouTube reviewers (Created Labs) explains it like this: RAM memory is like writing on a white board, it's made to be temporary. Writing to the SSD is like writing on paper with a pencil. It can be erased, but if it's written on and erased for too long, it's going to degrade the medium. It will take years for this to cause problems, but keep in mind that in these M1 MacBooks, none of the parts are replaceable. The SSD and the RAM are soldered onto the board. \n\n ***As ridiculously expensive as Apple RAM is, when it's not upgradable, get the maximum, in this case, 16 GB. \n\n I really doubt that Apple will be making machines with user upgradable RAM after the switch from Intel is complete, except for possibly the very high end Pro models. \n \n There is also the fact that if I am going to be doing a decent amount of video editing, a M1 with a fan will be helpful. Upgrading to the cheaper ($699+Upgrades) M1 Mac mini would be the cheapest way to get better performance for the Pro Apps, but I need a laptop, so... So, that is why I'm planning to return this machine and get one (likely the MacBook Pro M1), with 16 GB RAM & 1 TB SSD. \n\n ***A note on browsers, Safari is by far the BEST browser to run on the M1, at least for now. I always had issues with saving web pages as PDF files in Chrome, where it did not save most of the images/text on the page. In Safari, it's worked perfectly."
            },
            {
                "title": "Beautiful laptop. Worth the money",
                "author": "Try it or DIY it",
                "rating": "5.0 of 5",
                "message": "Beautiful laptop. I’ve upgraded from the MacBook Air of old...so far this laptop has blown it away. It wasn’t overly pricey to be honest and I feel it’s worth the price. Overall look is great and keyboard feel is nice. Larger touchpad is great, I’ve paired my Magic Trackpad 2 with it as well."
            },
            {
                "title": "Great laptop.",
                "author": "JJ",
                "rating": "5.0 of 5",
                "message": "No complains so far. Very fast and performs great. I had a 2014 MacBook Air and finally upgraded this year. This is leagues beyond that entry and I’m very happy with this upgrade."
            }
        ]
    },








    
    {

        "name": "2021 Apple MacBook Pro (14-inch, Apple M1 Pro chip with 8‑core CPU and 14‑core GPU, 16GB RAM, 512GB SSD) - Space Gray",
        "category": "Computers",
        "product_id": 2,
        "rating": "4.7 of 5",
        "total_ratings": 461,
        "original_price": null,
        "price": 1999.00,
        "in_stock": true,
        "main_image": "https://m.media-amazon.com/images/I/61vFO3R5UNL._AC_SL1500_.jpg",
        "images": [
            "https://m.media-amazon.com/images/I/61vFO3R5UNL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71YhRQy50oL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61JqllsE+DL._AC_SX522_.jpg",
            "https://m.media-amazon.com/images/I/81wxI2w9K9L._AC_SX522_.jpg",
            "https://m.media-amazon.com/images/I/818mB1ifjfL._AC_SX522_.jpg",
            "https://m.media-amazon.com/images/I/61P2ynHwgHL._AC_SX522_.jpg"
        ],


        "about_product": [
            "Apple M1 Pro or M1 Max chip for a massive leap in CPU, GPU, and machine learning performance",
            "Up to 10-core CPU delivers up to 3.7x faster performance to fly through pro workflows quicker than ever",
            "Up to 32-core GPU with up to 13x faster performance for graphics-intensive apps and games",
            "16-core Neural Engine for up to 11x faster machine learning performance",
            "Longer battery life, up to 17 hours",
            "Up to 64GB of unified memory so everything you do is fast and fluid.",
            "Up to 8TB of superfast SSD storage launches apps and opens files in an instant",
            "Stunning 14-inch Liquid Retina XDR display with extreme dynamic range and contrast ratio.",
            "AppleCare - Every Mac comes with a one-year limited warranty and up to 90 days of complimentary technical support. Get AppleCare+ to extend your coverage and reduce the stress and cost of unexpected repairs1080p FaceTime HD camera with advanced image signal processor for sharper video calls.",
            "Six-speaker sound system with force-cancelling woofers"
        ],


        "specifications": [
            "Model Name - MacBook Pro",
            "Brand - Apple",
            "Specific Uses For Product - Multimedia, Gaming, Business",
            "Screen Size - 14.2 Inches",
            "Operating System - Mac OS",
            "CPU Manufacturer -  Apple",
            "Graphics Card Description - Integrated",
            "Color - Space Gray",
            "Connectivity Technology - Bluetooth, Wi-Fi",
            "Hard Disk Size - 512 GB"
        ],
        "options": {
            "capacity": [ "512 GB", "1 TB" ]
        },


        "description_images": [
            "https://m.media-amazon.com/images/G/01/apple/MacBook_Pro_14-in_16-in_Product_Page_L__en-US_01._CB639392504_.jpg",
            "https://m.media-amazon.com/images/G/01/apple/MacBook_Pro_14-in_16-in_Product_Page_L__en-US_02._CB639392504_.jpg",
            "https://m.media-amazon.com/images/G/01/apple/MacBook_Pro_14-in_16-in_Product_Page_L__en-US_03._CB639392504_.jpg",
            "https://m.media-amazon.com/images/G/01/apple/MacBook_Pro_14-in_16-in_Product_Page_L__en-US_04._CB639392504_.jpg",
            "https://m.media-amazon.com/images/G/01/apple/MacBook_Pro_14-in_16-in_Product_Page_L__en-US_05._CB639392504_.jpg",
            "https://m.media-amazon.com/images/G/01/apple/MacBook_Pro_14-in_16-in_Product_Page_L__en-US_06._CB639392504_.jpg",
            "https://m.media-amazon.com/images/G/01/apple/MacBook_Pro_14-in_16-in_Product_Page_L__en-US_07._CB639392504_.jpg",
            "https://m.media-amazon.com/images/G/01/apple/MacBook_Pro_14-in_16-in_Product_Page_L__en-US_08._CB639392504_.jpg",
            "https://m.media-amazon.com/images/G/01/apple/MacBook_Pro_14-in_16-in_Product_Page_L__en-US_09._CB639387059_.jpg"
        ],
        "reviews": [
            {
                "title": "14' MacBook Pro vs. 13' MacBook Pro",
                "author": "Ian VINE VOICE",
                "rating": "5.0 of 5",
                "message": "I am writing this review focused primarily on people who are considering jumping from the 13' MacBook Pro to the 14' MacBook Pro, which is what I did. I moved from the 13' MacBook Pro M1 with 16gb of RAM to the 14' MacBook Pro M1 Pro with 16gb of RAM.\n\n Size: So, 1' of screen might not seem like a lot on its face, but the difference is pretty substantial, in my opinion. Even the pictures don't quite do it justice. The screen feels considerably larger in a package that isn't considerably larger. For me, it's the perfect sweet spot for someone who wants something larger than the 13' model, but smaller than the 16'. I had a 16' MacBook Pro i9 and it was just too much for me. This one feels perfect. \n\n Form Factor: The new 14' and 16' MacBooks both adopt a thicker chassis, which is shown in the pictures. As such, Apple decided to make the casing flat instead of gently rounded. It honestly reminds me of the pre-unibody builds, but still sleek and modern. If I didn't know this one was new and you just laid them side-by-side, I might say that the old form factor looks a little newer, but that isn't to say that it looks bad.\n\n Aesthetics: Overall, I touched on the aesthetics a bit in the 'form factor' section. It looks like a high-end laptop, but at the same time I can see some people thinking it looks dated. I personally like the flatter look over the more rounded look, but it will depend on the person. Another thing I like is moving the 'MacBook Pro' branding from under the screen to the bottom of the casing. I just think it provides a cleaner look during use. The black background of the keyboard is also a plus for me. The old space gray background was fine, but I really like the black."
            },
            {
                "title": "Remarkable",
                "author": "Charlie Carlisle",
                "rating": "5.0 of 5",
                "message": "I haven't upgraded my computer for more than a decade, so it would stand to reason any recent releases would impress me, but this macbook pro has gone above and beyond in the small time I've had it. \n\n The screen is truly something to behold. Smooth, clear, just beautiful. I don't typically care about bezels, but I might start. The expanded screen makes an unexpected difference. Meanwhile, I barely notice the notch. Apple said they'd find workarounds to make it scarce, and they have.\n\nThe speakers are wonderful as well. I was skeptical at first -- thought I caught some tinny effects on a couple songs, but the more I listen to them, the more I'm convinced the tinniness was in the recording (it was a live album, which might explain it). As for the spatial audio, I've only heard a couple songs, but it's pretty trippy. This is my first experience with it, and it doesn't disappoint.\n\n In the short time I've had the computer, it's been nothing but fast. Probably more computer than I need, so if you're a sound editor or photographer, this review probably isn't for you. But for those of you casual users who want a solid machine that will last (as I said, my last macbook pro made it more than a decade), this is the one. Excited as I was for my last macbook, I could see room for improvement at the time. Right now, I don't see how things get better than this."
            },
            {
                "title": "Best MacBook Pro ever - for a lot of reasons",
                "author": "Jake",
                "rating": "5.0 of 5",
                "message": "M1 pro chip is super powerful - photo/video editing, graphic design - this thing just kills it. Compared to previous MacBook Pro, it's a giant leap ahead. These tasks are a main reason to buy the pro version of the Macbook. This particularly model is the lower end of the spec you can get for a pro, but it still kicks butt. You can get the Pro Max chip and bump up the RAM to 64GB if you want - and add tons more storage. The 14 inch MacBook pro is the perfect size for a balance of portability and power. It can do pretty much everything the 16 inch version does. The display is stunning. Just gorgeous. 120hz capability (pro motion) gets rid of blur when scrolling and makes for clearer action when viewing movies. The brightness and black levels on the display are awesome. Real HDR viewing - a big difference. You will hear about 'the notch' at the top of the screen where the camera is. After 10 minutes I don't even notice it. It means nothing for your experience. Its just something critics have chosen to harp about. in most apps the notch is no even visible. Camera is now a full 1080p and is a big upgrade over previous MacBooks. Six speaker sound system with new woofers - sounds incredible. Music/movies it feels like surround sound. For video conferencing the microphones are studio quality and you can tell - this is great for video conferencing. The keyboard is a dream to type on. Very solid like all MacBooks, no spongy feel you get with so many other laptops. The Apple Magic Keyboard is the best - as is the track pad. Battery life is amazing. I have gone all day on battery without needing to plug in. At best its spec says 17 hours, which is crazy! Especially for this spec...but for real world use with a mix of tasks, it won't be 17 hours but I did a 9 hour session yesterday, and still had a ton of battery left. The power efficiency is ground breaking. They have added back the MagSafe power plug - which is great! And added back an SD card slot and and an HDMI port - which many of us hated the previous macs that deleted these ports. I wish it had at least one USB-A old style port - but it doesn't. You get three USB-C thunderbolt 4 ports that you can use with adapters if needed. They got rid of the touch screen bar at the top of the keyboard from previous pro MacBooks and put back the regular mechanical keys for the controls. Apparently they listened to a lot of users who didn't really like the touch pad. The shape and style of this laptop is great. Some say the edge of the laptop looks 'sharp' where your wrists rest. That is BS. I have been typing most of the day and I don't feel any issue with the edge of the laptop at all. Very comfy for typing. Some haters may try to find reasons to bash this new Macbook Pro, but I am telling you - from any perspective, all brand bias aside - this is an amazing laptop - the best Apple has ever made, hands down. And I would say you won't find a better power laptop anywhere. All that said - this is not a gamers machine. Apple is not for hard core gamers. I mean you can play games on it that you get from the app store. I am a hard core gamer and a PC geek - I have a powerful windows PC for gaming. And always will. But for everything else. this MacBook is king. I use to for music, for photo and video editing, for productivity. I can plut into a giant monitor if I want a bigger screen - it works great on my 34 inch IPS panel. So if you are wondering if this Macbook 14 inch pro is the real deal or not - I am here to tell you, its the real deal. I finally upgraded from my 2015 MacBook pro because this new one hits so many sweet spots - revolutionary power and battery life, excellent ergonomic design, great sound, stunning display - its the whole package. If you are thinking of getting one - you won't be disappointed. One last comment. I am an old timer windows guy, and I know all the counter arguments for the Mac. Many wills say this is overpriced compared to a windows laptop with similar spec. First, show me an intel based laptop that can match these new M1 Pro chips - you can't. And aside from that, the Mac OS is secure and stable - rock solid - and is intuitive with amazing features - like the ability to copy and paste text FROM A PHOTO! Whaaat? And the design/ergonomics/quality of these MacBooks is unmatched. So, yes you pay more - but you get more. My last MacBook pro lasted me almost 7 years and it still works great. If you want this laptop - get it! It rocks."
            }
        ]
    },










    
    {

        "name": "SAMSUNG Galaxy S21 Ultra 5G Factory Unlocked Android Cell Phone 128GB US Version Smartphone Pro-Grade Camera 8K Video 108MP High Res, Phantom Silver",
        "category": "Cellphones",
        "product_id": 3,
        "rating": "4.7 of 5",
        "total_ratings": 1058,
        "original_price": null,
        "price": 951.67,
        "in_stock": true,
        "main_image": "https://m.media-amazon.com/images/I/61bLefD79-L._AC_SL1020_.jpg",
        "images": [
            "https://m.media-amazon.com/images/I/61bLefD79-L._AC_SL1020_.jpg",
            "https://m.media-amazon.com/images/I/61qn89wmuSL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61HhJ9zerbL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/612yzDzdE0L._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/91rGsg7W-ZL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61cr60tHEHL._AC_SL1500_.jpg"
        ],


        "about_product": [
            "PRO-GRADE CAMERA: Zoom in close with 100X Space Zoom, and take photos and videos like a pro with our easy-to-use, multi-lens camera.",
            "SHARP 8K VIDEO: Capture your life’s best moments in head-turning, super-smooth, cinema quality 8K Video.",
            "MULTIPLE WAYS TO RECORD: Create share-ready videos and GIFs with multi-cam recording and automatic, professional-style effects.",
            "HIGHER RESOLUTION, 100X ZOOM: Get amazing clarity with a dual lens combo of 3X and 10X optical zoom and revolutionary 100X Space Zoom.",
            "ALL DAY INTELLIGENT BATTERY: Intuitively manages your cellphone’s usage, so you can go all day without charging.",
            "POWER OF 5G: Experience next-generation connectivity for everything you love to do: more sharing, more gaming, more experiences.",
            "Battery power consumption depends on usage patterns and results may vary. Devices will work on any compatible network. Wireless voice, data and messaging services are compatible with most GSM networks such as AT&T and T-Mobile and CDMA networks such as Verizon, Sprint and US Cellular"
        ],


        "specifications": [
            "Model Name - P3",
            "Wireless Carrier - Unlocked",
            "Brand - SAMSUNG",
            "Form Factor - Smartphone",
            "Memory Storage Capacity - 128 GB",
            "Operating System - Android",
            "Color - Phantom Silver",
            "Cellular Technology - 5G",
            "SIM card slot count - Dual SIM",
            "Year 2021"
        ],
        "options": {
            "capacity": [ "512 GB", "1 TB" ]
        },


        "description_images": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/b4bdb05b-c086-41b1-9951-5905eb4bd561.__CR0,0,3050,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/cfd4ebec-4d8d-47e2-b796-6c6090f61839.__CR0,0,3050,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d8745c53-6943-4075-91fa-4b166c10285e.__CR1,0,3050,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/53f9595b-c820-4b7e-ade3-0de5c54f2a1f.__CR1,0,3050,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3e6ef167-9667-40a2-85c0-1ad69157ff61.__CR0,0,3050,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ae1c62da-7abd-4ad1-b49f-b3a18b5eec0d.__CR0,0,3050,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/48668568-a14c-40c7-95a0-a6dfcb7ff674.__CR0,0,3050,1250_PT0_SX1464_V1___.jpg"
        ],
        "reviews": [
            {
                "title": "A mind-blowing and incredible experience.",
                "author": "Jalen",
                "rating": "5.0 of 5",
                "message": "I wanted to give this phone some full usage before I wrote my review and I can finally get into full detail. Before I jump into my pros vs cons let's just mention my personal final thoughts.\nGet it! Thought over.\nWhether you are transitioning from Apple to Android or just upgrading, this is without question the correct choice. With the latest chipset, processors, camera array, and intelligent software there are so many possibilities.\n\nPros:\n1) The battery life is absolutely insane. Now at first I wasn't sure how I felt about the battery. It seemed average after the first day or two of use. But something clicked half way through the third day of use. I had read from articles and watched YouTube reviews from TechTubers about this intelligent software. I expected them to be referencing the Ai. But it is so much deeper in that. This phone continues to monitor your usage and learn the way you operate with it. Pair it with a smart watch to perfectly shift usage and workload. At no point since purchase has this device seemed to struggle. I can comfortably say this is a 2 day phone easily. 2 days of continuous normal usage before needing a recharge.\n\n2) The finger print reader is vastly improved from previous devices and can now be compared to the likes of devices like One Plus. Yes you will have to spend a good minute or so letting every point of your finger be thoroughly mapped out but it has proven to be lightning fast in response.\n\n3) This camera...phew. if there was ever a single reason to choose the Ultra variant over the other two it is absolutely due to the camera. Laser focus, combined with smart lenses, and a true melody of beautiful spec options results in a user paradise. One could literally place a fruit, a leaf, and some random option side by side for a shot and notice visible suggestion. The fruit will display a food shot mode. The leaf will suggest aspect ratio options or even the ultrawide/ Auto-Focus macro shot mode. Truly mastering this camera will not only take time but also lot of practice, something I personally look forward to.\n\n4) This may seem like something that at first should be obvious. But use of this device just truly feels so effortless and fluid. Everything works how I would want it to, and at just a speed that truly leaves you with a sense of relief.\n\nCons:\n1) Inevitably as with all Samsung products of course there is some bloatware. But from what I've seen it at least is not overwhelming. A few apps I know I'll never used sprinkled around. But those have just been compiled into a folder and forgotten about.\n\n2) To some this may be a nuisance so it's worth mentioning. Although this device has an Android OS, it is noticeable the amount of strictly Samsung branded apps/Widgets available. It will take some navigating to better arrange your set up to one's preference. Especially when it comes to something such as utilizing the Google Play Store vs Samsung Store.\n\n3) Third but maybe most importantly, given the circumstances everyone is facing due to Covid-19 the price is certainly a factor. Even with sales yes this is a price handset. Yes there was a price drop from last year, but that doesn't really soften the blow.\n\n4) No charging brick. No matter how it is explained or reasoned, the absence of the brick is felt! On first charge I did use a prior usb-C to usb-a charger and wow.....talked about watching paint dry. There was absolutely no way that is truly the best option across the board for all the relevant phone companies. (Ended up buying a usb-c IQ charger from Anker. I think that was like $14 approximately. Definitely an immediate and noticeable remedy, thanks Anker for that save.)\n\nIf one were to say is this phone worth the 999$-1200$ price tag. Honest answer, absolutely, depending on how one plans to use it. If you want the BEST experience out of the three variants (S21, S21+,S21 ultra) there is only one choice. However if that price point just isn't within your budget or path of purchase, I can still say the other two options will suffice also."
            },
            {
                "title": "Remarkable",
                "author": "Charlie Carlisle",
                "rating": "5.0 of 5",
                "message": "I haven't upgraded my computer for more than a decade, so it would stand to reason any recent releases would impress me, but this macbook pro has gone above and beyond in the small time I've had it. \n\n The screen is truly something to behold. Smooth, clear, just beautiful. I don't typically care about bezels, but I might start. The expanded screen makes an unexpected difference. Meanwhile, I barely notice the notch. Apple said they'd find workarounds to make it scarce, and they have.\n\nThe speakers are wonderful as well. I was skeptical at first -- thought I caught some tinny effects on a couple songs, but the more I listen to them, the more I'm convinced the tinniness was in the recording (it was a live album, which might explain it). As for the spatial audio, I've only heard a couple songs, but it's pretty trippy. This is my first experience with it, and it doesn't disappoint.\n\n In the short time I've had the computer, it's been nothing but fast. Probably more computer than I need, so if you're a sound editor or photographer, this review probably isn't for you. But for those of you casual users who want a solid machine that will last (as I said, my last macbook pro made it more than a decade), this is the one. Excited as I was for my last macbook, I could see room for improvement at the time. Right now, I don't see how things get better than this."
            },
            {
                "title": "Best MacBook Pro ever - for a lot of reasons",
                "author": "Jake",
                "rating": "5.0 of 5",
                "message": "M1 pro chip is super powerful - photo/video editing, graphic design - this thing just kills it. Compared to previous MacBook Pro, it's a giant leap ahead. These tasks are a main reason to buy the pro version of the Macbook. This particularly model is the lower end of the spec you can get for a pro, but it still kicks butt. You can get the Pro Max chip and bump up the RAM to 64GB if you want - and add tons more storage. The 14 inch MacBook pro is the perfect size for a balance of portability and power. It can do pretty much everything the 16 inch version does. The display is stunning. Just gorgeous. 120hz capability (pro motion) gets rid of blur when scrolling and makes for clearer action when viewing movies. The brightness and black levels on the display are awesome. Real HDR viewing - a big difference. You will hear about 'the notch' at the top of the screen where the camera is. After 10 minutes I don't even notice it. It means nothing for your experience. Its just something critics have chosen to harp about. in most apps the notch is no even visible. Camera is now a full 1080p and is a big upgrade over previous MacBooks. Six speaker sound system with new woofers - sounds incredible. Music/movies it feels like surround sound. For video conferencing the microphones are studio quality and you can tell - this is great for video conferencing. The keyboard is a dream to type on. Very solid like all MacBooks, no spongy feel you get with so many other laptops. The Apple Magic Keyboard is the best - as is the track pad. Battery life is amazing. I have gone all day on battery without needing to plug in. At best its spec says 17 hours, which is crazy! Especially for this spec...but for real world use with a mix of tasks, it won't be 17 hours but I did a 9 hour session yesterday, and still had a ton of battery left. The power efficiency is ground breaking. They have added back the MagSafe power plug - which is great! And added back an SD card slot and and an HDMI port - which many of us hated the previous macs that deleted these ports. I wish it had at least one USB-A old style port - but it doesn't. You get three USB-C thunderbolt 4 ports that you can use with adapters if needed. They got rid of the touch screen bar at the top of the keyboard from previous pro MacBooks and put back the regular mechanical keys for the controls. Apparently they listened to a lot of users who didn't really like the touch pad. The shape and style of this laptop is great. Some say the edge of the laptop looks 'sharp' where your wrists rest. That is BS. I have been typing most of the day and I don't feel any issue with the edge of the laptop at all. Very comfy for typing. Some haters may try to find reasons to bash this new Macbook Pro, but I am telling you - from any perspective, all brand bias aside - this is an amazing laptop - the best Apple has ever made, hands down. And I would say you won't find a better power laptop anywhere. All that said - this is not a gamers machine. Apple is not for hard core gamers. I mean you can play games on it that you get from the app store. I am a hard core gamer and a PC geek - I have a powerful windows PC for gaming. And always will. But for everything else. this MacBook is king. I use to for music, for photo and video editing, for productivity. I can plut into a giant monitor if I want a bigger screen - it works great on my 34 inch IPS panel. So if you are wondering if this Macbook 14 inch pro is the real deal or not - I am here to tell you, its the real deal. I finally upgraded from my 2015 MacBook pro because this new one hits so many sweet spots - revolutionary power and battery life, excellent ergonomic design, great sound, stunning display - its the whole package. If you are thinking of getting one - you won't be disappointed. One last comment. I am an old timer windows guy, and I know all the counter arguments for the Mac. Many wills say this is overpriced compared to a windows laptop with similar spec. First, show me an intel based laptop that can match these new M1 Pro chips - you can't. And aside from that, the Mac OS is secure and stable - rock solid - and is intuitive with amazing features - like the ability to copy and paste text FROM A PHOTO! Whaaat? And the design/ergonomics/quality of these MacBooks is unmatched. So, yes you pay more - but you get more. My last MacBook pro lasted me almost 7 years and it still works great. If you want this laptop - get it! It rocks."
            }
        ]
    },












    
    {

        "name": "Samsung Galaxy S20+ 5G BTS Edition Factory Unlocked New Android Cell phone US Version| 128GB of Storage | Fingerprint ID and Facial Recognition | Long-Lasting Battery | Haze Purple",
        "category": "Cellphones",
        "product_id": 4,
        "rating": "4.7 of 5",
        "total_ratings": 209,
        "original_price": null,
        "price": 729.49,
        "in_stock": true,
        "main_image": "https://m.media-amazon.com/images/I/71NQ4Xib0eL._AC_SL1500_.jpg",
        "images": [
            "https://m.media-amazon.com/images/I/71NQ4Xib0eL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61IQb+GTl+L._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/616qobEPkZL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61c+6Df1IsL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61MnEv5ck4L._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71w15n3u09L._AC_SL1500_.jpg"
        ],


        "about_product": [
            "Symbolizing love and unity, the Galaxy S20+ 5G BTS Edition is coated in a dreamy Haze Purple.",
            "But beauty is only skin deep, so we infused BTS imagery and spirit right into the heard of this limited edition device.",
            "Complete with live wallpaper, 7 collectable BTS photo cards, unique stickers, an inspiring lock screen and more, members of the A.R.M.Y. will not want to miss out on this one-of-a-kind collaboration.",
            "Power of 5G: Get next-level power for everything you love to do with Samsung Galaxy 5G; Share more, game harder, experience more and never miss a beat",
            "Single Take AI: Capture video and multiple types of images with one tap of the shutter button; Lenses, effects and filters capture the best of every moment, every time",
            "Hi-Res Camera Zoom: Capture hi-res images as if you’re 3 feet away, from 100 feet away; Whether you want to zoom in close from afar or magnify details nearby, the new 30x Space Zoom gives you impressive power and clarity",
            "Bright Night Mode: Capture crisp images and vibrant video in Bright Night mode and create high-quality content in low light – no flash needed",
            "Super Fast Charging: Charge up quicker with Super Fast Charge so you can keep moving with more juice; Give your buds – or Galaxy buds – a boost of power with Wireless PowerShare right from Galaxy S20+ Plus 5G",
            "All-Day Battery: Galaxy S20+ Plus 5G’s intelligent battery uses an algorithm to learn from how you live to optimize power and take you through a day or more of work and life without ever giving out on you"
        ],


        "specifications": [
            "Model Name - S20+",
            "Wireless Carrier - Unlocked",
            "Brand - SAMSUNG",
            "Form Factor - Smartphone",
            "Memory Storage Capacity - 128 GB",
            "Operating System - Android",
            "Color - Haze Purpler",
            "Cellular Technology - 5G",
            "SIM card slot count - Dual SIM",
            "Screen Size - 6.8 Inches"
        ],
        "options": {
            "capacity": [ ]
        },


        "description_images": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/b4bdb05b-c086-41b1-9951-5905eb4bd561.__CR0,0,3050,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/cfd4ebec-4d8d-47e2-b796-6c6090f61839.__CR0,0,3050,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d8745c53-6943-4075-91fa-4b166c10285e.__CR1,0,3050,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/53f9595b-c820-4b7e-ade3-0de5c54f2a1f.__CR1,0,3050,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3e6ef167-9667-40a2-85c0-1ad69157ff61.__CR0,0,3050,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ae1c62da-7abd-4ad1-b49f-b3a18b5eec0d.__CR0,0,3050,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/48668568-a14c-40c7-95a0-a6dfcb7ff674.__CR0,0,3050,1250_PT0_SX1464_V1___.jpg"
        ],
        "reviews": [
            {
                "title": "Limited Edition s20+ 5g",
                "author": "Jessica",
                "rating": "5.0 of 5",
                "message": "Bought the BTS Limited edition, absolutely gorgeous. Works extremely well, no problems. Camera is perfect, auto focus is perfect, gives the iphone11 a run for it's money."
            },
            {
                "title": "BEST PHONE EVER",
                "author": "Suzi",
                "rating": "5.0 of 5",
                "message": "I've been eyeing the S20+ for awhile now. I'm glad I upgrad my phone. This phone works like magic. The design of the phone is beautifully made and the system is easy to use. I'm huge fan of Samsung and BTS, so when I heard about this collaboration, I couldn't wait to get my hands on it. One of the Best phone Samsung came out with."
            },
            {
                "title": "Beautiful Phone",
                "author": "Amazon Costumer",
                "rating": "5.0 of 5",
                "message": "Honestly, really pretty phone, even if I wasn't a BTS fan I would probably consider getting it."
            },
            {
                "title": "BTS theme + mini SD slot",
                "author": "J. Baek",
                "rating": "5.0 of 5",
                "message": "Welp, as we all now know, Samsung is experimenting with going the way of Apple with hard limits to storage space. Shame. I originally bought this phone to upgrade from an S9+ which had been working fine until I dropped it and the screen cracked. I could probably have replaced the screen easily but the BTS theme was enough to convince me to upgrade. The hologram purple back is a beaut and I still get compliments on it. Ofc it's usually safely tucked under a protective (now dull, less transparent) case, but it still shines through.\n\nI'm glad I got this phone as opposed to waiting for the S21 bc one of the main reasons I switched to Android was for the ease of adding more storage and moving files to/fro the phone to a computer. So far, I still love my phone and have never really experienced any more connectivity issues compared to my last few phones (iPhone 8+, Galaxy S9+). The speed of switching btw one app to another, one function to another, has never felt slow for me unless for some reason, an app is not loading (usually the fault of the app). The size of the app is big enough so that sometimes I experience trouble using only one hand but never to the point where I absolutely have to hold it with both hands for most functions. The camera is in the middle of screen instead of a dedicated space at the top so that when you're taking fullscreen photos, you will see a 'floating' black dot but I quickly got over that. Whatever I'm taking photos of will be towards the center of the screen 98% of the time anyway.\n\nTo name some cons, one of my main complaints would be smoothness of video while filming but I've noticed this since Galaxy S9+. Currently I don't have a huge need for video so I'm happy as a clam with this phone. Hoping I won't be needing upgrade for a while! So far, nothing new in the phone market has made me consider switching to something else anytime soon."
            }
        ]
    },













    
    {

        "name": "Samsung Galaxy S21 FE 5G Cell Phone, Factory Unlocked Android Smartphone, 128GB, 120Hz Display, Pro Grade Camera, All Day Intelligent Battery, US Version, Graphite",
        "category": "Cellphones",
        "product_id": 5,
        "rating": "4.6 of 5",
        "total_ratings": 8687,
        "original_price": 699.99,
        "price": 549.49,
        "in_stock": true,
        "main_image": "https://m.media-amazon.com/images/I/61ZNIHIEUqL._AC_SL1500_.jpg",
        "images": [
            "https://m.media-amazon.com/images/I/61ZNIHIEUqL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/51yPq54K+ZL._AC_SL1201_.jpg",
            "https://m.media-amazon.com/images/I/31O+ytTzUyL._AC_SL1201_.jpg",
            "https://m.media-amazon.com/images/I/71LHz2oJkML._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71ZS+x7-1PL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/51FYgHiItjL._AC_SL1200_.jpg"
        ],


        "about_product": [
            "SMOOTH SCROLLING: The 120Hz display delivers a super smooth scroll, with optimized refresh rate, and a fast touch response gives seamless visuals in both work and play",
            "REAL DISPLAY VISION: The high quality display with Dynamic AMOLED 2X delivers vibrant color and brightness, even in bright sunlight",
            "PRO-GRADE CAMERA: The powerful pro grade camera delivers high quality photos and videos, with a Rear Camera that boasts 12MP Ultra Wide, Wide-angle cameras and an 8MP Telephoto Camera; It also features a Front Camera that includes a 32MP Selfie Camera",
            "30X SPACE ZOOM: 30x SpaceZoom combines a 3x Hybrid Optic Zoom and 30x digital zoom for high resolution close ups, while the EngageZoom Lock reduces shakiness the further your zoom in",
            "SUPERIOR PERFORMANCE: The power-efficient processor chip offers reliability and performance that boosts every experience, from graphic-heavy gaming to multitasking.",
            "ALL DAY INTELLIGENT POWER: The 4500mAh intelligent battery outlasts the day, even on 5G, while Super Fast Charging can charge 50% in 30 minutes."
        ],


        "specifications": [
            "Model Name - S21 FE",
            "Wireless Carrier - Unlocked",
            "Brand - SAMSUNG",
            "Form Factor - Smartphone",
            "Memory Storage Capacity - 128 GB",
            "Operating System - Android",
            "Color - Graphite",
            "Cellular Technology - 5G",
            "SIM card slot count - Dual SIM",
            "Year - 2021"
        ],
        "options": {
            "capacity": [ ]
        },


        "description_images": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5acc00e7-f7a9-4457-8589-f0abdc156364.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a498a173-0a00-4f7f-b5d4-0816f5cf97c3.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/55d5605c-a273-4df1-a3ef-70e95d2bee79.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/94abdd43-d1be-4a85-a29a-ad140b95c37a.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "reviews": [
            {
                "title": "It's just OK",
                "author": "Jacob E",
                "rating": "3.0 of 5",
                "message": "Coming from a pixel 2 I expected more.\nFront camera is slow and very blurry in low-light\nvibration intensity is pathetic, I keep missing calls.\nit's obnoxiously large\nfingerprint scanner is inconsistent at best, even without any screen protection (if anyone had one in stock)\nSamsung's version of android is garbage, I actually downgraded from Android 11 to 10\n\nbattery life is better than my ancient phone.\nwifi6 is fast, about 300Mbps tested\nWifi6 Stats:\nChannel 40 (11ax)\nSignal 94% (-53 dBm)\nRx Rate 960 Mbps\nTx Rate 648 Mbps\nPower Save Enabled\n\n5G is decent (LTE+ indicated at 100Mbps down, 4Mbps up, AT&T in Raleigh, NC)'."
            },
            {
                "title": "My Review of the S20 FE",
                "author": "Tyrone",
                "rating": "4.0 of 5",
                "message": "Performance = 9 / 10 - fast Snapdragon cpu but only only 6gb ram\n\nDisplay = 8.7 / 10 - 120ghz is great but screen is washed compared to s10/s20\n\nBatttery = 8.8 / 10 - all day battery\n\nDesign = 8.7 / 10 - flat screen but bezels could be smaller\n\nCamera = 9 /10 - great main cameras - selfie camera is MEH and pics can be blurry on moving objects\n\nFeatures = 9/10 - three years of software updates..5g...a lot of color options .. ip68 .. wireless charging .. dex\n\n"
            },
            {
                "title": "Bait & Switch",
                "author": "Jake",
                "rating": "4.0 of 5",
                "message": "When I purchased this it was listed as 8gb of ram but the model I received is 6gb. That makes me feel lured into something I wasn't expecting.\n\nThe phone is a solid overall phone with premium performance for the price due to sacrificing the build quality by making the back plastic and the screen gorilla glass 3 instead of 6.\n\nDoesn't matter to me as I wanted an unused device (battery) with a top notch processor for the smallest price point.\n\nI'm still slightly upset about not getting 8gb as was listed when I purchased which is why I didn't rate 5/5."
            }
        ]
    },














    {

        "name": "2020 Apple MacBook Pro with Apple M1 Chip (13-inch, 8GB RAM, 256GB SSD Storage) - Silver",
        "category": "Computers",
        "product_id": 6,
        "rating": "4.8 of 5",
        "total_ratings": 5986,
        "original_price": 1299.00,
        "price": 1149.99,
        "in_stock": true,
        "main_image": "https://m.media-amazon.com/images/I/71gD8WdSlaL._AC_SL1500_.jpg",
        "images": [
            "https://m.media-amazon.com/images/I/71gD8WdSlaL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/81AkdxBCVpL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/91xkiFp-lzL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71Bh8LMhLTL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71Z4vYGB3EL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71nRj-fGoZL._AC_SL1500_.jpg"
        ],


        "about_product": [
            "Apple-designed M1 chip for a giant leap in CPU, GPU, and machine learning performance.",
            "Get more done with up to 20 hours of battery life, the longest ever in a Mac.",
            "8-core CPU delivers up to 2.8x faster performance to fly through workflows quicker than ever.",
            "8-core GPU with up to 5x faster graphics for graphics-intensive apps and games.",
            "16-core Neural Engine for advanced machine learning.",
            "8GB of unified memory so everything you do is fast and fluid.",
            "Superfast SSD storage launches apps and opens files in an instant.",
            "Active cooling system sustains incredible performance.",
            "13.3-inch Retina display with 500 nits of brightness for vibrant colors and incredible image detail.",
            "FaceTime HD camera with advanced image signal processor for clearer, sharper video calls."
        ],


        "specifications": [
            "Model Name - MacBook Air",
            "Brand - Apple",
            "Specific Uses For Product - Personal, Gaming, Business",
            "Screen Size - 13.3 Inches",
            "Operating System - Mac OS",
            "CPU Manufacturer -  Apple",
            "Graphics Card Description - Integrated",
            "Color - Silver",
            "Connectivity Technology - Bluetooth, Wi-Fi, USB",
            "Hard Disk Size - 256 GB"
        ],
        "options": {
            "capacity": [ "256 GB", "512 GB" ]
        },


        "description_images": [
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/V2-MacBook_Pro_13-in_Product_Page_L_M1_Chip_v2__en-US_01._CB415534499_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/V2-MacBook_Pro_13-in_Product_Page_L_M1_Chip_v2__en-US_02._CB415534499_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/V2-MacBook_Pro_13-in_Product_Page_L_M1_Chip_v2__en-US_03._CB415534499_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/V2-MacBook_Pro_13-in_Product_Page_L_M1_Chip_v2__en-US_04._CB415534499_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/V2-MacBook_Pro_13-in_Product_Page_L_M1_Chip_v2__en-US_05._CB415534499_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/V2-MacBook_Pro_13-in_Product_Page_L_M1_Chip_v2__en-US_06._CB415534499_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/V2-MacBook_Pro_13-in_Product_Page_L_M1_Chip_v2__en-US_07._CB415534499_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/V2-MacBook_Pro_13-in_Product_Page_L_M1_Chip_v2__en-US_08._CB415534499_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/V2-MacBook_Pro_13-in_Product_Page_L_M1_Chip_v2__en-US_09._CB415534499_.jpg"
        ],
        "reviews": [
            {
                "title": "Best Laptop in History",
                "author": "JK Reviews",
                "rating": "5.0 of 5",
                "message": "I got my new MacBook Pro M1 two weeks ago and could not be more happy with it. This machine is absolutely incredible in terms of speed, looks, weight/size, display, and battery life - and texture (it feels so good against the skin on my wrists as I type) and basically anything else you can think of. I also love the space gray color, the new keyboard, the Touch Bar, and the larger trackpad. There are so many options to customize the system to work just the way I like.\nMy previous MacBook was the 2011 model and it still works today, but after 10 years it became too slow and the trackpad had trouble clicking, so after a TON of research, I decided to pull the trigger and get the New MacBook Pro with the M1 chip.\nA couple suggestions I am able to give after spending almost two months and probably over 30 hours researching the new MacBook are: go with the standard model of 8gb of RAM and the 256 ssd - you can get this on Amazon for $1239 vs $1299 at Apple - so you get to save 60 bucks, and you have the added satsfaction of not having to deal with the snobby nerd losers that work in the Apple Store, who asked me rudely when I went in to get a new laptop 'umm, do you have an appointment? Well, you're going to have to make an appointment if you want to go in the store'. I love Apple products and will never use another phone or computer besides the iPhone and MacBook, but after that experience I will never again give my business to the physical Apple Stores. I mean, seriously, do you really need me to make an appointment to buy a $1300 laptop? Whatever dude.\nAnyway, in several YouTube videos that compared the 8GB ram model along side the 16GB ram model (costs 200 bucks more), the 8GB performed just as well in nearly every task - and they really pushed it to the limits. The only reason to pay up for the 16GB RAM is if you want to edit 8K UHD videos or are a super serious music recording artist or highly advanced professional photographer - and even then it's not too much of a difference. For the every day user (me or baly anyone who is not a computer professional) the 8GB working with this new M1 chip is mind-blowing, blows any other laptop on the market completely out of the water, and actually even performs just as well as the $2200 15 inch MacBook Pro using the Intel chip. As far as the storage goes, 256 ssd is standard - that's what I got - and you can pay 200 bucks more for 512 ssd or 400 bucks more for 1 TB. But with the Cloud storage available now, you don't really need to keep much on the laptop drive, you can just save it to the cloud.\nOverall I honestly could go on for hours about every little detail that I absolutely love about this machine. A free one year subscription to Apple TV is also another little perk. But I am still mystified every day at how incredible this machine is. I've been online for over 3 hours now and its still on 92% battery. The new Retina display is brilliant. Everything is perfect. I truly am in love this laptop and would recommend that anyone looking for a new laptop to last a long time and outperform everything else on the market gets the new matchbook 13 inch M1."
            },
            {
                "title": "Amazing",
                "author": "Westmark Consulting",
                "rating": "5.0 of 5",
                "message": "I bought my Mac from Apple directly not from Amazon. This thing is amazing. Battery life is awesome. Hard to believe that I can work with it all day and do not have to charge at all even with bright screen.\n\nNo issues with speed at all. I use Matlab a lot and this computer is even slightly faster than my desktop with 12 core AMD CPU and 32 GB ram.\n\nExcellent machine. Happy I bought it."
            },
            {
                "title": "I love my Mac",
                "author": "Anscestor Hunter",
                "rating": "5.0 of 5",
                "message": "It's a Mac once you go Mac you never go back. This is my second Mac my first lasted almost 9 years."
            }
        ]
    },































    {

        "name": "2020 Apple MacBook Air Laptop: Apple M1 Chip, 13” Retina Display, 8GB RAM, 256GB SSD Storage, Backlit Keyboard, FaceTime HD Camera, Touch ID. Works with iPhone/iPad",
        "category": "Computers",
        "product_id": 7,
        "rating": "4.8 of 5",
        "total_ratings": 13802,
        "original_price": 1050.00,
        "price": 979.00,
        "in_stock": true,
        "main_image": "https://m.media-amazon.com/images/I/71vFKBpKakL._AC_SL1500_.jpg",
        "images": [
            "https://m.media-amazon.com/images/I/71vFKBpKakL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/81HZAfCGZ5L._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/81PeNcC5W4L._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61UVTIkDLuL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71hHMsqVzGL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71zFHzUBzuL._AC_SL1500_.jpg"
        ],
    
    
        "about_product": [
            "All-Day Battery Life - Go longer than ever with up to 18 hours of battery life.",
            "Powerful Performance - Take on everything from professional-quality editing to action-packed gaming with ease. The Apple M1 chip with an 8-core CPU delivers up to 3.5x faster performance than the previous generation while using way less power.",
            "Superfast Memory  8GB of unified memory makes your entire system speedy and responsive. That way it can support tasks like memory-hogging multitab browsing and opening a huge graphic file quickly and easily.",
            "Stunning Display - With a 13.3” Retina display, images come alive with new levels of realism. Text is sharp and clear, and colors are more vibrant.",
            "Why Mac - Easy to learn. Easy to set up. Astoundingly powerful. Intuitive. Packed with apps to use right out of the box. Mac is designed to let you work, play, and create like never before.",
            "Simply Compatible - All your existing apps work, including Adobe Creative Cloud, Microsoft 365, and Google Drive. Plus you can use your favorite iPhone and iPad apps directly on macOS. Altogether you'll have access to the biggest collection of apps ever for Mac. All available on the App Store.",
            "Easy to Learn - If you already have an iPhone, MacBook Air feels familiar from the moment you turn it on. And it works perfectly with all your Apple devices. Use your iPad to extend the workspace of your Mac, answer texts and phone calls directly on your Mac, and more.",
            "Fanless Design - Your MacBook Air stays cool and runs quietly even while tackling intense workloads.",
            "AppleCare - Every Mac comes with a one-year limited warranty and up to 90 days of complimentary technical support. Get AppleCare+ to extend your coverage and reduce the stress and cost of unexpected repairs.",
            "Environmentally Friendly - MacBook Air is made with a 100% recycled aluminum enclosure and uses less energy for a smaller carbon footprint."
        ],
    
    
        "specifications": [
            "Model Name - MacBook Air",
            "Brand - Apple",
            "Specific Uses For Product - Multimedia, Personal, Business",
            "Screen Size - 13.3 Inches",
            "Operating System - Mac OS",
            "Human Interface Input - Keyboard",
            "CPU Manufacturer -  Apple",
            "Graphics Card Description - Integrated",
            "Color - Gold",
            "Connectivity Technology - Bluetooth, Wi-Fi, Bluetooth 5.0"
        ],
        "options": {
            "capacity": [ "256 GB", "512 GB" ]
        },
    
    
        "description_images": [
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/MacBook_Air_Product_Page_L_M1_Chip__en-US_01._CB416881859_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/MacBook_Air_Product_Page_L_M1_Chip__en-US_02._CB416881859_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/MacBook_Air_Product_Page_L_M1_Chip__en-US_03._CB416881859_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/MacBook_Air_Product_Page_L_M1_Chip__en-US_04._CB416881859_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/MacBook_Air_Product_Page_L_M1_Chip__en-US_05._CB416881859_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/MacBook_Air_Product_Page_L_M1_Chip__en-US_06._CB416881859_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/MacBook_Air_Product_Page_L_M1_Chip__en-US_07._CB416881859_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/MacBook_Air_Product_Page_L_M1_Chip__en-US_08._CB416881859_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/MacBook_Air_Product_Page_L_M1_Chip__en-US_09._CB416881859_.jpg"
        ],
        "reviews": [
            {
                "title": "MAKE SURE YOU GET AS MUCH MEMORY & STORAGE AS YOU CAN AFFORD - SPECIAL ORDER IF NEED BE",
                "author": "K. MURPHY",
                "rating": "5.0 of 5",
                "message": "UPDATE 12-15-2020 - After three weeks, I'm still really impressed with the M1 MacBook Air/8 Core CPU/8 Core GPU/512 SSD/8GB RAM. --- My updated plea: MAKE SURE YOU GET AS MUCH MEMORY & STORAGE AS YOU CAN AFFORD. SPECIAL ORDER ONE TO YOUR PROJECTED FUTURE NEED! \n\n Remember, Macs live a very long time and the value it holds will depend on how usable it will be to you or someone else in 5 or even 10 years. Not that long ago, 80 GB hard drives were HUGE... and UPGRADABLE. RAM was upgradable. The SSD and the RAM in these machines is NOT upgradable. \n\n The one issue for me has been that I am a memory hog! I tend to have LOTS of tabs open at once (I've caught myself with 50 (Safari) open in one browser and 39 (Chrome) in another!), while running Affinity/Final Cut Pro - and YES, the dreaded Beach Ball has reared it's ugly head. Well, this got me to assess what I will be using the machine for and for how long. \n\n Storage can be added with external drives, slower, but it will let you scrape by. RAM is another story. When you constantly use up RAM, the system starts using swap memory where it uses the SSD to store temporary files. One of the YouTube reviewers (Created Labs) explains it like this: RAM memory is like writing on a white board, it's made to be temporary. Writing to the SSD is like writing on paper with a pencil. It can be erased, but if it's written on and erased for too long, it's going to degrade the medium. It will take years for this to cause problems, but keep in mind that in these M1 MacBooks, none of the parts are replaceable. The SSD and the RAM are soldered onto the board. \n\n ***As ridiculously expensive as Apple RAM is, when it's not upgradable, get the maximum, in this case, 16 GB. \n\n I really doubt that Apple will be making machines with user upgradable RAM after the switch from Intel is complete, except for possibly the very high end Pro models. \n \n There is also the fact that if I am going to be doing a decent amount of video editing, a M1 with a fan will be helpful. Upgrading to the cheaper ($699+Upgrades) M1 Mac mini would be the cheapest way to get better performance for the Pro Apps, but I need a laptop, so... So, that is why I'm planning to return this machine and get one (likely the MacBook Pro M1), with 16 GB RAM & 1 TB SSD. \n\n ***A note on browsers, Safari is by far the BEST browser to run on the M1, at least for now. I always had issues with saving web pages as PDF files in Chrome, where it did not save most of the images/text on the page. In Safari, it's worked perfectly."
            },
            {
                "title": "Beautiful laptop. Worth the money",
                "author": "Try it or DIY it",
                "rating": "5.0 of 5",
                "message": "Beautiful laptop. I’ve upgraded from the MacBook Air of old...so far this laptop has blown it away. It wasn’t overly pricey to be honest and I feel it’s worth the price. Overall look is great and keyboard feel is nice. Larger touchpad is great, I’ve paired my Magic Trackpad 2 with it as well."
            },
            {
                "title": "Great laptop.",
                "author": "JJ",
                "rating": "5.0 of 5",
                "message": "No complains so far. Very fast and performs great. I had a 2014 MacBook Air and finally upgraded this year. This is leagues beyond that entry and I’m very happy with this upgrade."
            }
        ]
    },
    
    
    
    
    
    
    
    
    
    {
    
        "name": "2021 Apple MacBook Pro (14-inch, Apple M1 Pro chip with 8‑core CPU and 14‑core GPU, 16GB RAM, 512GB SSD) - Space Gray",
        "category": "Computers",
        "product_id": 8,
        "rating": "4.7 of 5",
        "total_ratings": 461,
        "original_price": null,
        "price": 1999.00,
        "in_stock": true,
        "main_image": "https://m.media-amazon.com/images/I/61vFO3R5UNL._AC_SL1500_.jpg",
        "images": [
            "https://m.media-amazon.com/images/I/61vFO3R5UNL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71YhRQy50oL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61JqllsE+DL._AC_SX522_.jpg",
            "https://m.media-amazon.com/images/I/81wxI2w9K9L._AC_SX522_.jpg",
            "https://m.media-amazon.com/images/I/818mB1ifjfL._AC_SX522_.jpg",
            "https://m.media-amazon.com/images/I/61P2ynHwgHL._AC_SX522_.jpg"
        ],
    
    
        "about_product": [
            "Apple M1 Pro or M1 Max chip for a massive leap in CPU, GPU, and machine learning performance",
            "Up to 10-core CPU delivers up to 3.7x faster performance to fly through pro workflows quicker than ever",
            "Up to 32-core GPU with up to 13x faster performance for graphics-intensive apps and games",
            "16-core Neural Engine for up to 11x faster machine learning performance",
            "Longer battery life, up to 17 hours",
            "Up to 64GB of unified memory so everything you do is fast and fluid.",
            "Up to 8TB of superfast SSD storage launches apps and opens files in an instant",
            "Stunning 14-inch Liquid Retina XDR display with extreme dynamic range and contrast ratio.",
            "AppleCare - Every Mac comes with a one-year limited warranty and up to 90 days of complimentary technical support. Get AppleCare+ to extend your coverage and reduce the stress and cost of unexpected repairs1080p FaceTime HD camera with advanced image signal processor for sharper video calls.",
            "Six-speaker sound system with force-cancelling woofers"
        ],
    
    
        "specifications": [
            "Model Name - MacBook Pro",
            "Brand - Apple",
            "Specific Uses For Product - Multimedia, Gaming, Business",
            "Screen Size - 14.2 Inches",
            "Operating System - Mac OS",
            "CPU Manufacturer -  Apple",
            "Graphics Card Description - Integrated",
            "Color - Space Gray",
            "Connectivity Technology - Bluetooth, Wi-Fi",
            "Hard Disk Size - 512 GB"
        ],
        "options": {
            "capacity": [ "512 GB", "1 TB" ]
        },
    
    
        "description_images": [
            "https://m.media-amazon.com/images/G/01/apple/MacBook_Pro_14-in_16-in_Product_Page_L__en-US_01._CB639392504_.jpg",
            "https://m.media-amazon.com/images/G/01/apple/MacBook_Pro_14-in_16-in_Product_Page_L__en-US_02._CB639392504_.jpg",
            "https://m.media-amazon.com/images/G/01/apple/MacBook_Pro_14-in_16-in_Product_Page_L__en-US_03._CB639392504_.jpg",
            "https://m.media-amazon.com/images/G/01/apple/MacBook_Pro_14-in_16-in_Product_Page_L__en-US_04._CB639392504_.jpg",
            "https://m.media-amazon.com/images/G/01/apple/MacBook_Pro_14-in_16-in_Product_Page_L__en-US_05._CB639392504_.jpg",
            "https://m.media-amazon.com/images/G/01/apple/MacBook_Pro_14-in_16-in_Product_Page_L__en-US_06._CB639392504_.jpg",
            "https://m.media-amazon.com/images/G/01/apple/MacBook_Pro_14-in_16-in_Product_Page_L__en-US_07._CB639392504_.jpg",
            "https://m.media-amazon.com/images/G/01/apple/MacBook_Pro_14-in_16-in_Product_Page_L__en-US_08._CB639392504_.jpg",
            "https://m.media-amazon.com/images/G/01/apple/MacBook_Pro_14-in_16-in_Product_Page_L__en-US_09._CB639387059_.jpg"
        ],
        "reviews": [
            {
                "title": "14' MacBook Pro vs. 13' MacBook Pro",
                "author": "Ian VINE VOICE",
                "rating": "5.0 of 5",
                "message": "I am writing this review focused primarily on people who are considering jumping from the 13' MacBook Pro to the 14' MacBook Pro, which is what I did. I moved from the 13' MacBook Pro M1 with 16gb of RAM to the 14' MacBook Pro M1 Pro with 16gb of RAM.\n\n Size: So, 1' of screen might not seem like a lot on its face, but the difference is pretty substantial, in my opinion. Even the pictures don't quite do it justice. The screen feels considerably larger in a package that isn't considerably larger. For me, it's the perfect sweet spot for someone who wants something larger than the 13' model, but smaller than the 16'. I had a 16' MacBook Pro i9 and it was just too much for me. This one feels perfect. \n\n Form Factor: The new 14' and 16' MacBooks both adopt a thicker chassis, which is shown in the pictures. As such, Apple decided to make the casing flat instead of gently rounded. It honestly reminds me of the pre-unibody builds, but still sleek and modern. If I didn't know this one was new and you just laid them side-by-side, I might say that the old form factor looks a little newer, but that isn't to say that it looks bad.\n\n Aesthetics: Overall, I touched on the aesthetics a bit in the 'form factor' section. It looks like a high-end laptop, but at the same time I can see some people thinking it looks dated. I personally like the flatter look over the more rounded look, but it will depend on the person. Another thing I like is moving the 'MacBook Pro' branding from under the screen to the bottom of the casing. I just think it provides a cleaner look during use. The black background of the keyboard is also a plus for me. The old space gray background was fine, but I really like the black."
            },
            {
                "title": "Remarkable",
                "author": "Charlie Carlisle",
                "rating": "5.0 of 5",
                "message": "I haven't upgraded my computer for more than a decade, so it would stand to reason any recent releases would impress me, but this macbook pro has gone above and beyond in the small time I've had it. \n\n The screen is truly something to behold. Smooth, clear, just beautiful. I don't typically care about bezels, but I might start. The expanded screen makes an unexpected difference. Meanwhile, I barely notice the notch. Apple said they'd find workarounds to make it scarce, and they have.\n\nThe speakers are wonderful as well. I was skeptical at first -- thought I caught some tinny effects on a couple songs, but the more I listen to them, the more I'm convinced the tinniness was in the recording (it was a live album, which might explain it). As for the spatial audio, I've only heard a couple songs, but it's pretty trippy. This is my first experience with it, and it doesn't disappoint.\n\n In the short time I've had the computer, it's been nothing but fast. Probably more computer than I need, so if you're a sound editor or photographer, this review probably isn't for you. But for those of you casual users who want a solid machine that will last (as I said, my last macbook pro made it more than a decade), this is the one. Excited as I was for my last macbook, I could see room for improvement at the time. Right now, I don't see how things get better than this."
            },
            {
                "title": "Best MacBook Pro ever - for a lot of reasons",
                "author": "Jake",
                "rating": "5.0 of 5",
                "message": "M1 pro chip is super powerful - photo/video editing, graphic design - this thing just kills it. Compared to previous MacBook Pro, it's a giant leap ahead. These tasks are a main reason to buy the pro version of the Macbook. This particularly model is the lower end of the spec you can get for a pro, but it still kicks butt. You can get the Pro Max chip and bump up the RAM to 64GB if you want - and add tons more storage. The 14 inch MacBook pro is the perfect size for a balance of portability and power. It can do pretty much everything the 16 inch version does. The display is stunning. Just gorgeous. 120hz capability (pro motion) gets rid of blur when scrolling and makes for clearer action when viewing movies. The brightness and black levels on the display are awesome. Real HDR viewing - a big difference. You will hear about 'the notch' at the top of the screen where the camera is. After 10 minutes I don't even notice it. It means nothing for your experience. Its just something critics have chosen to harp about. in most apps the notch is no even visible. Camera is now a full 1080p and is a big upgrade over previous MacBooks. Six speaker sound system with new woofers - sounds incredible. Music/movies it feels like surround sound. For video conferencing the microphones are studio quality and you can tell - this is great for video conferencing. The keyboard is a dream to type on. Very solid like all MacBooks, no spongy feel you get with so many other laptops. The Apple Magic Keyboard is the best - as is the track pad. Battery life is amazing. I have gone all day on battery without needing to plug in. At best its spec says 17 hours, which is crazy! Especially for this spec...but for real world use with a mix of tasks, it won't be 17 hours but I did a 9 hour session yesterday, and still had a ton of battery left. The power efficiency is ground breaking. They have added back the MagSafe power plug - which is great! And added back an SD card slot and and an HDMI port - which many of us hated the previous macs that deleted these ports. I wish it had at least one USB-A old style port - but it doesn't. You get three USB-C thunderbolt 4 ports that you can use with adapters if needed. They got rid of the touch screen bar at the top of the keyboard from previous pro MacBooks and put back the regular mechanical keys for the controls. Apparently they listened to a lot of users who didn't really like the touch pad. The shape and style of this laptop is great. Some say the edge of the laptop looks 'sharp' where your wrists rest. That is BS. I have been typing most of the day and I don't feel any issue with the edge of the laptop at all. Very comfy for typing. Some haters may try to find reasons to bash this new Macbook Pro, but I am telling you - from any perspective, all brand bias aside - this is an amazing laptop - the best Apple has ever made, hands down. And I would say you won't find a better power laptop anywhere. All that said - this is not a gamers machine. Apple is not for hard core gamers. I mean you can play games on it that you get from the app store. I am a hard core gamer and a PC geek - I have a powerful windows PC for gaming. And always will. But for everything else. this MacBook is king. I use to for music, for photo and video editing, for productivity. I can plut into a giant monitor if I want a bigger screen - it works great on my 34 inch IPS panel. So if you are wondering if this Macbook 14 inch pro is the real deal or not - I am here to tell you, its the real deal. I finally upgraded from my 2015 MacBook pro because this new one hits so many sweet spots - revolutionary power and battery life, excellent ergonomic design, great sound, stunning display - its the whole package. If you are thinking of getting one - you won't be disappointed. One last comment. I am an old timer windows guy, and I know all the counter arguments for the Mac. Many wills say this is overpriced compared to a windows laptop with similar spec. First, show me an intel based laptop that can match these new M1 Pro chips - you can't. And aside from that, the Mac OS is secure and stable - rock solid - and is intuitive with amazing features - like the ability to copy and paste text FROM A PHOTO! Whaaat? And the design/ergonomics/quality of these MacBooks is unmatched. So, yes you pay more - but you get more. My last MacBook pro lasted me almost 7 years and it still works great. If you want this laptop - get it! It rocks."
            }
        ]
    },
    
    
    
    
    
    
    
    
    
    
    
    {
    
        "name": "SAMSUNG Galaxy S21 Ultra 5G Factory Unlocked Android Cell Phone 128GB US Version Smartphone Pro-Grade Camera 8K Video 108MP High Res, Phantom Silver",
        "category": "Cellphones",
        "product_id": 9,
        "rating": "4.7 of 5",
        "total_ratings": 1058,
        "original_price": null,
        "price": 951.67,
        "in_stock": true,
        "main_image": "https://m.media-amazon.com/images/I/61bLefD79-L._AC_SL1020_.jpg",
        "images": [
            "https://m.media-amazon.com/images/I/61bLefD79-L._AC_SL1020_.jpg",
            "https://m.media-amazon.com/images/I/61qn89wmuSL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61HhJ9zerbL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/612yzDzdE0L._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/91rGsg7W-ZL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61cr60tHEHL._AC_SL1500_.jpg"
        ],
    
    
        "about_product": [
            "PRO-GRADE CAMERA: Zoom in close with 100X Space Zoom, and take photos and videos like a pro with our easy-to-use, multi-lens camera.",
            "SHARP 8K VIDEO: Capture your life’s best moments in head-turning, super-smooth, cinema quality 8K Video.",
            "MULTIPLE WAYS TO RECORD: Create share-ready videos and GIFs with multi-cam recording and automatic, professional-style effects.",
            "HIGHER RESOLUTION, 100X ZOOM: Get amazing clarity with a dual lens combo of 3X and 10X optical zoom and revolutionary 100X Space Zoom.",
            "ALL DAY INTELLIGENT BATTERY: Intuitively manages your cellphone’s usage, so you can go all day without charging.",
            "POWER OF 5G: Experience next-generation connectivity for everything you love to do: more sharing, more gaming, more experiences.",
            "Battery power consumption depends on usage patterns and results may vary. Devices will work on any compatible network. Wireless voice, data and messaging services are compatible with most GSM networks such as AT&T and T-Mobile and CDMA networks such as Verizon, Sprint and US Cellular"
        ],
    
    
        "specifications": [
            "Model Name - P3",
            "Wireless Carrier - Unlocked",
            "Brand - SAMSUNG",
            "Form Factor - Smartphone",
            "Memory Storage Capacity - 128 GB",
            "Operating System - Android",
            "Color - Phantom Silver",
            "Cellular Technology - 5G",
            "SIM card slot count - Dual SIM",
            "Year 2021"
        ],
        "options": {
            "capacity": [ "512 GB", "1 TB" ]
        },
    
    
        "description_images": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/b4bdb05b-c086-41b1-9951-5905eb4bd561.__CR0,0,3050,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/cfd4ebec-4d8d-47e2-b796-6c6090f61839.__CR0,0,3050,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d8745c53-6943-4075-91fa-4b166c10285e.__CR1,0,3050,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/53f9595b-c820-4b7e-ade3-0de5c54f2a1f.__CR1,0,3050,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3e6ef167-9667-40a2-85c0-1ad69157ff61.__CR0,0,3050,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ae1c62da-7abd-4ad1-b49f-b3a18b5eec0d.__CR0,0,3050,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/48668568-a14c-40c7-95a0-a6dfcb7ff674.__CR0,0,3050,1250_PT0_SX1464_V1___.jpg"
        ],
        "reviews": [
            {
                "title": "A mind-blowing and incredible experience.",
                "author": "Jalen",
                "rating": "5.0 of 5",
                "message": "I wanted to give this phone some full usage before I wrote my review and I can finally get into full detail. Before I jump into my pros vs cons let's just mention my personal final thoughts.\nGet it! Thought over.\nWhether you are transitioning from Apple to Android or just upgrading, this is without question the correct choice. With the latest chipset, processors, camera array, and intelligent software there are so many possibilities.\n\nPros:\n1) The battery life is absolutely insane. Now at first I wasn't sure how I felt about the battery. It seemed average after the first day or two of use. But something clicked half way through the third day of use. I had read from articles and watched YouTube reviews from TechTubers about this intelligent software. I expected them to be referencing the Ai. But it is so much deeper in that. This phone continues to monitor your usage and learn the way you operate with it. Pair it with a smart watch to perfectly shift usage and workload. At no point since purchase has this device seemed to struggle. I can comfortably say this is a 2 day phone easily. 2 days of continuous normal usage before needing a recharge.\n\n2) The finger print reader is vastly improved from previous devices and can now be compared to the likes of devices like One Plus. Yes you will have to spend a good minute or so letting every point of your finger be thoroughly mapped out but it has proven to be lightning fast in response.\n\n3) This camera...phew. if there was ever a single reason to choose the Ultra variant over the other two it is absolutely due to the camera. Laser focus, combined with smart lenses, and a true melody of beautiful spec options results in a user paradise. One could literally place a fruit, a leaf, and some random option side by side for a shot and notice visible suggestion. The fruit will display a food shot mode. The leaf will suggest aspect ratio options or even the ultrawide/ Auto-Focus macro shot mode. Truly mastering this camera will not only take time but also lot of practice, something I personally look forward to.\n\n4) This may seem like something that at first should be obvious. But use of this device just truly feels so effortless and fluid. Everything works how I would want it to, and at just a speed that truly leaves you with a sense of relief.\n\nCons:\n1) Inevitably as with all Samsung products of course there is some bloatware. But from what I've seen it at least is not overwhelming. A few apps I know I'll never used sprinkled around. But those have just been compiled into a folder and forgotten about.\n\n2) To some this may be a nuisance so it's worth mentioning. Although this device has an Android OS, it is noticeable the amount of strictly Samsung branded apps/Widgets available. It will take some navigating to better arrange your set up to one's preference. Especially when it comes to something such as utilizing the Google Play Store vs Samsung Store.\n\n3) Third but maybe most importantly, given the circumstances everyone is facing due to Covid-19 the price is certainly a factor. Even with sales yes this is a price handset. Yes there was a price drop from last year, but that doesn't really soften the blow.\n\n4) No charging brick. No matter how it is explained or reasoned, the absence of the brick is felt! On first charge I did use a prior usb-C to usb-a charger and wow.....talked about watching paint dry. There was absolutely no way that is truly the best option across the board for all the relevant phone companies. (Ended up buying a usb-c IQ charger from Anker. I think that was like $14 approximately. Definitely an immediate and noticeable remedy, thanks Anker for that save.)\n\nIf one were to say is this phone worth the 999$-1200$ price tag. Honest answer, absolutely, depending on how one plans to use it. If you want the BEST experience out of the three variants (S21, S21+,S21 ultra) there is only one choice. However if that price point just isn't within your budget or path of purchase, I can still say the other two options will suffice also."
            },
            {
                "title": "Remarkable",
                "author": "Charlie Carlisle",
                "rating": "5.0 of 5",
                "message": "I haven't upgraded my computer for more than a decade, so it would stand to reason any recent releases would impress me, but this macbook pro has gone above and beyond in the small time I've had it. \n\n The screen is truly something to behold. Smooth, clear, just beautiful. I don't typically care about bezels, but I might start. The expanded screen makes an unexpected difference. Meanwhile, I barely notice the notch. Apple said they'd find workarounds to make it scarce, and they have.\n\nThe speakers are wonderful as well. I was skeptical at first -- thought I caught some tinny effects on a couple songs, but the more I listen to them, the more I'm convinced the tinniness was in the recording (it was a live album, which might explain it). As for the spatial audio, I've only heard a couple songs, but it's pretty trippy. This is my first experience with it, and it doesn't disappoint.\n\n In the short time I've had the computer, it's been nothing but fast. Probably more computer than I need, so if you're a sound editor or photographer, this review probably isn't for you. But for those of you casual users who want a solid machine that will last (as I said, my last macbook pro made it more than a decade), this is the one. Excited as I was for my last macbook, I could see room for improvement at the time. Right now, I don't see how things get better than this."
            },
            {
                "title": "Best MacBook Pro ever - for a lot of reasons",
                "author": "Jake",
                "rating": "5.0 of 5",
                "message": "M1 pro chip is super powerful - photo/video editing, graphic design - this thing just kills it. Compared to previous MacBook Pro, it's a giant leap ahead. These tasks are a main reason to buy the pro version of the Macbook. This particularly model is the lower end of the spec you can get for a pro, but it still kicks butt. You can get the Pro Max chip and bump up the RAM to 64GB if you want - and add tons more storage. The 14 inch MacBook pro is the perfect size for a balance of portability and power. It can do pretty much everything the 16 inch version does. The display is stunning. Just gorgeous. 120hz capability (pro motion) gets rid of blur when scrolling and makes for clearer action when viewing movies. The brightness and black levels on the display are awesome. Real HDR viewing - a big difference. You will hear about 'the notch' at the top of the screen where the camera is. After 10 minutes I don't even notice it. It means nothing for your experience. Its just something critics have chosen to harp about. in most apps the notch is no even visible. Camera is now a full 1080p and is a big upgrade over previous MacBooks. Six speaker sound system with new woofers - sounds incredible. Music/movies it feels like surround sound. For video conferencing the microphones are studio quality and you can tell - this is great for video conferencing. The keyboard is a dream to type on. Very solid like all MacBooks, no spongy feel you get with so many other laptops. The Apple Magic Keyboard is the best - as is the track pad. Battery life is amazing. I have gone all day on battery without needing to plug in. At best its spec says 17 hours, which is crazy! Especially for this spec...but for real world use with a mix of tasks, it won't be 17 hours but I did a 9 hour session yesterday, and still had a ton of battery left. The power efficiency is ground breaking. They have added back the MagSafe power plug - which is great! And added back an SD card slot and and an HDMI port - which many of us hated the previous macs that deleted these ports. I wish it had at least one USB-A old style port - but it doesn't. You get three USB-C thunderbolt 4 ports that you can use with adapters if needed. They got rid of the touch screen bar at the top of the keyboard from previous pro MacBooks and put back the regular mechanical keys for the controls. Apparently they listened to a lot of users who didn't really like the touch pad. The shape and style of this laptop is great. Some say the edge of the laptop looks 'sharp' where your wrists rest. That is BS. I have been typing most of the day and I don't feel any issue with the edge of the laptop at all. Very comfy for typing. Some haters may try to find reasons to bash this new Macbook Pro, but I am telling you - from any perspective, all brand bias aside - this is an amazing laptop - the best Apple has ever made, hands down. And I would say you won't find a better power laptop anywhere. All that said - this is not a gamers machine. Apple is not for hard core gamers. I mean you can play games on it that you get from the app store. I am a hard core gamer and a PC geek - I have a powerful windows PC for gaming. And always will. But for everything else. this MacBook is king. I use to for music, for photo and video editing, for productivity. I can plut into a giant monitor if I want a bigger screen - it works great on my 34 inch IPS panel. So if you are wondering if this Macbook 14 inch pro is the real deal or not - I am here to tell you, its the real deal. I finally upgraded from my 2015 MacBook pro because this new one hits so many sweet spots - revolutionary power and battery life, excellent ergonomic design, great sound, stunning display - its the whole package. If you are thinking of getting one - you won't be disappointed. One last comment. I am an old timer windows guy, and I know all the counter arguments for the Mac. Many wills say this is overpriced compared to a windows laptop with similar spec. First, show me an intel based laptop that can match these new M1 Pro chips - you can't. And aside from that, the Mac OS is secure and stable - rock solid - and is intuitive with amazing features - like the ability to copy and paste text FROM A PHOTO! Whaaat? And the design/ergonomics/quality of these MacBooks is unmatched. So, yes you pay more - but you get more. My last MacBook pro lasted me almost 7 years and it still works great. If you want this laptop - get it! It rocks."
            }
        ]
    },
    
    
    
    
    
    
    
    
    
    
    
    
    
    {
    
        "name": "Samsung Galaxy S20+ 5G BTS Edition Factory Unlocked New Android Cell phone US Version| 128GB of Storage | Fingerprint ID and Facial Recognition | Long-Lasting Battery | Haze Purple",
        "category": "Cellphones",
        "product_id": 10,
        "rating": "4.7 of 5",
        "total_ratings": 209,
        "original_price": null,
        "price": 729.49,
        "in_stock": true,
        "main_image": "https://m.media-amazon.com/images/I/71NQ4Xib0eL._AC_SL1500_.jpg",
        "images": [
            "https://m.media-amazon.com/images/I/71NQ4Xib0eL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61IQb+GTl+L._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/616qobEPkZL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61c+6Df1IsL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61MnEv5ck4L._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71w15n3u09L._AC_SL1500_.jpg"
        ],
    
    
        "about_product": [
            "Symbolizing love and unity, the Galaxy S20+ 5G BTS Edition is coated in a dreamy Haze Purple.",
            "But beauty is only skin deep, so we infused BTS imagery and spirit right into the heard of this limited edition device.",
            "Complete with live wallpaper, 7 collectable BTS photo cards, unique stickers, an inspiring lock screen and more, members of the A.R.M.Y. will not want to miss out on this one-of-a-kind collaboration.",
            "Power of 5G: Get next-level power for everything you love to do with Samsung Galaxy 5G; Share more, game harder, experience more and never miss a beat",
            "Single Take AI: Capture video and multiple types of images with one tap of the shutter button; Lenses, effects and filters capture the best of every moment, every time",
            "Hi-Res Camera Zoom: Capture hi-res images as if you’re 3 feet away, from 100 feet away; Whether you want to zoom in close from afar or magnify details nearby, the new 30x Space Zoom gives you impressive power and clarity",
            "Bright Night Mode: Capture crisp images and vibrant video in Bright Night mode and create high-quality content in low light – no flash needed",
            "Super Fast Charging: Charge up quicker with Super Fast Charge so you can keep moving with more juice; Give your buds – or Galaxy buds – a boost of power with Wireless PowerShare right from Galaxy S20+ Plus 5G",
            "All-Day Battery: Galaxy S20+ Plus 5G’s intelligent battery uses an algorithm to learn from how you live to optimize power and take you through a day or more of work and life without ever giving out on you"
        ],
    
    
        "specifications": [
            "Model Name - S20+",
            "Wireless Carrier - Unlocked",
            "Brand - SAMSUNG",
            "Form Factor - Smartphone",
            "Memory Storage Capacity - 128 GB",
            "Operating System - Android",
            "Color - Haze Purpler",
            "Cellular Technology - 5G",
            "SIM card slot count - Dual SIM",
            "Screen Size - 6.8 Inches"
        ],
        "options": {
            "capacity": [ ]
        },
    
    
        "description_images": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/b4bdb05b-c086-41b1-9951-5905eb4bd561.__CR0,0,3050,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/cfd4ebec-4d8d-47e2-b796-6c6090f61839.__CR0,0,3050,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d8745c53-6943-4075-91fa-4b166c10285e.__CR1,0,3050,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/53f9595b-c820-4b7e-ade3-0de5c54f2a1f.__CR1,0,3050,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3e6ef167-9667-40a2-85c0-1ad69157ff61.__CR0,0,3050,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ae1c62da-7abd-4ad1-b49f-b3a18b5eec0d.__CR0,0,3050,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/48668568-a14c-40c7-95a0-a6dfcb7ff674.__CR0,0,3050,1250_PT0_SX1464_V1___.jpg"
        ],
        "reviews": [
            {
                "title": "Limited Edition s20+ 5g",
                "author": "Jessica",
                "rating": "5.0 of 5",
                "message": "Bought the BTS Limited edition, absolutely gorgeous. Works extremely well, no problems. Camera is perfect, auto focus is perfect, gives the iphone11 a run for it's money."
            },
            {
                "title": "BEST PHONE EVER",
                "author": "Suzi",
                "rating": "5.0 of 5",
                "message": "I've been eyeing the S20+ for awhile now. I'm glad I upgrad my phone. This phone works like magic. The design of the phone is beautifully made and the system is easy to use. I'm huge fan of Samsung and BTS, so when I heard about this collaboration, I couldn't wait to get my hands on it. One of the Best phone Samsung came out with."
            },
            {
                "title": "Beautiful Phone",
                "author": "Amazon Costumer",
                "rating": "5.0 of 5",
                "message": "Honestly, really pretty phone, even if I wasn't a BTS fan I would probably consider getting it."
            },
            {
                "title": "BTS theme + mini SD slot",
                "author": "J. Baek",
                "rating": "5.0 of 5",
                "message": "Welp, as we all now know, Samsung is experimenting with going the way of Apple with hard limits to storage space. Shame. I originally bought this phone to upgrade from an S9+ which had been working fine until I dropped it and the screen cracked. I could probably have replaced the screen easily but the BTS theme was enough to convince me to upgrade. The hologram purple back is a beaut and I still get compliments on it. Ofc it's usually safely tucked under a protective (now dull, less transparent) case, but it still shines through.\n\nI'm glad I got this phone as opposed to waiting for the S21 bc one of the main reasons I switched to Android was for the ease of adding more storage and moving files to/fro the phone to a computer. So far, I still love my phone and have never really experienced any more connectivity issues compared to my last few phones (iPhone 8+, Galaxy S9+). The speed of switching btw one app to another, one function to another, has never felt slow for me unless for some reason, an app is not loading (usually the fault of the app). The size of the app is big enough so that sometimes I experience trouble using only one hand but never to the point where I absolutely have to hold it with both hands for most functions. The camera is in the middle of screen instead of a dedicated space at the top so that when you're taking fullscreen photos, you will see a 'floating' black dot but I quickly got over that. Whatever I'm taking photos of will be towards the center of the screen 98% of the time anyway.\n\nTo name some cons, one of my main complaints would be smoothness of video while filming but I've noticed this since Galaxy S9+. Currently I don't have a huge need for video so I'm happy as a clam with this phone. Hoping I won't be needing upgrade for a while! So far, nothing new in the phone market has made me consider switching to something else anytime soon."
            }
        ]
    },
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    {
    
        "name": "Samsung Galaxy S21 FE 5G Cell Phone, Factory Unlocked Android Smartphone, 128GB, 120Hz Display, Pro Grade Camera, All Day Intelligent Battery, US Version, Graphite",
        "category": "Cellphones",
        "product_id": 11,
        "rating": "4.6 of 5",
        "total_ratings": 8687,
        "original_price": 699.99,
        "price": 549.49,
        "in_stock": true,
        "main_image": "https://m.media-amazon.com/images/I/61ZNIHIEUqL._AC_SL1500_.jpg",
        "images": [
            "https://m.media-amazon.com/images/I/61ZNIHIEUqL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/51yPq54K+ZL._AC_SL1201_.jpg",
            "https://m.media-amazon.com/images/I/31O+ytTzUyL._AC_SL1201_.jpg",
            "https://m.media-amazon.com/images/I/71LHz2oJkML._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71ZS+x7-1PL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/51FYgHiItjL._AC_SL1200_.jpg"
        ],
    
    
        "about_product": [
            "SMOOTH SCROLLING: The 120Hz display delivers a super smooth scroll, with optimized refresh rate, and a fast touch response gives seamless visuals in both work and play",
            "REAL DISPLAY VISION: The high quality display with Dynamic AMOLED 2X delivers vibrant color and brightness, even in bright sunlight",
            "PRO-GRADE CAMERA: The powerful pro grade camera delivers high quality photos and videos, with a Rear Camera that boasts 12MP Ultra Wide, Wide-angle cameras and an 8MP Telephoto Camera; It also features a Front Camera that includes a 32MP Selfie Camera",
            "30X SPACE ZOOM: 30x SpaceZoom combines a 3x Hybrid Optic Zoom and 30x digital zoom for high resolution close ups, while the EngageZoom Lock reduces shakiness the further your zoom in",
            "SUPERIOR PERFORMANCE: The power-efficient processor chip offers reliability and performance that boosts every experience, from graphic-heavy gaming to multitasking.",
            "ALL DAY INTELLIGENT POWER: The 4500mAh intelligent battery outlasts the day, even on 5G, while Super Fast Charging can charge 50% in 30 minutes."
        ],
    
    
        "specifications": [
            "Model Name - S21 FE",
            "Wireless Carrier - Unlocked",
            "Brand - SAMSUNG",
            "Form Factor - Smartphone",
            "Memory Storage Capacity - 128 GB",
            "Operating System - Android",
            "Color - Graphite",
            "Cellular Technology - 5G",
            "SIM card slot count - Dual SIM",
            "Year - 2021"
        ],
        "options": {
            "capacity": [ ]
        },
    
    
        "description_images": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5acc00e7-f7a9-4457-8589-f0abdc156364.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a498a173-0a00-4f7f-b5d4-0816f5cf97c3.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/55d5605c-a273-4df1-a3ef-70e95d2bee79.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/94abdd43-d1be-4a85-a29a-ad140b95c37a.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "reviews": [
            {
                "title": "It's just OK",
                "author": "Jacob E",
                "rating": "3.0 of 5",
                "message": "Coming from a pixel 2 I expected more.\nFront camera is slow and very blurry in low-light\nvibration intensity is pathetic, I keep missing calls.\nit's obnoxiously large\nfingerprint scanner is inconsistent at best, even without any screen protection (if anyone had one in stock)\nSamsung's version of android is garbage, I actually downgraded from Android 11 to 10\n\nbattery life is better than my ancient phone.\nwifi6 is fast, about 300Mbps tested\nWifi6 Stats:\nChannel 40 (11ax)\nSignal 94% (-53 dBm)\nRx Rate 960 Mbps\nTx Rate 648 Mbps\nPower Save Enabled\n\n5G is decent (LTE+ indicated at 100Mbps down, 4Mbps up, AT&T in Raleigh, NC)'."
            },
            {
                "title": "My Review of the S20 FE",
                "author": "Tyrone",
                "rating": "4.0 of 5",
                "message": "Performance = 9 / 10 - fast Snapdragon cpu but only only 6gb ram\n\nDisplay = 8.7 / 10 - 120ghz is great but screen is washed compared to s10/s20\n\nBatttery = 8.8 / 10 - all day battery\n\nDesign = 8.7 / 10 - flat screen but bezels could be smaller\n\nCamera = 9 /10 - great main cameras - selfie camera is MEH and pics can be blurry on moving objects\n\nFeatures = 9/10 - three years of software updates..5g...a lot of color options .. ip68 .. wireless charging .. dex\n\n"
            },
            {
                "title": "Bait & Switch",
                "author": "Jake",
                "rating": "4.0 of 5",
                "message": "When I purchased this it was listed as 8gb of ram but the model I received is 6gb. That makes me feel lured into something I wasn't expecting.\n\nThe phone is a solid overall phone with premium performance for the price due to sacrificing the build quality by making the back plastic and the screen gorilla glass 3 instead of 6.\n\nDoesn't matter to me as I wanted an unused device (battery) with a top notch processor for the smallest price point.\n\nI'm still slightly upset about not getting 8gb as was listed when I purchased which is why I didn't rate 5/5."
            }
        ]
    },
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    {
    
        "name": "2020 Apple MacBook Pro with Apple M1 Chip (13-inch, 8GB RAM, 256GB SSD Storage) - Silver",
        "category": "Computers",
        "product_id": 12,
        "rating": "4.8 of 5",
        "total_ratings": 5986,
        "original_price": 1299.00,
        "price": 1149.99,
        "in_stock": true,
        "main_image": "https://m.media-amazon.com/images/I/71gD8WdSlaL._AC_SL1500_.jpg",
        "images": [
            "https://m.media-amazon.com/images/I/71gD8WdSlaL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/81AkdxBCVpL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/91xkiFp-lzL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71Bh8LMhLTL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71Z4vYGB3EL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71nRj-fGoZL._AC_SL1500_.jpg"
        ],
    
    
        "about_product": [
            "Apple-designed M1 chip for a giant leap in CPU, GPU, and machine learning performance.",
            "Get more done with up to 20 hours of battery life, the longest ever in a Mac.",
            "8-core CPU delivers up to 2.8x faster performance to fly through workflows quicker than ever.",
            "8-core GPU with up to 5x faster graphics for graphics-intensive apps and games.",
            "16-core Neural Engine for advanced machine learning.",
            "8GB of unified memory so everything you do is fast and fluid.",
            "Superfast SSD storage launches apps and opens files in an instant.",
            "Active cooling system sustains incredible performance.",
            "13.3-inch Retina display with 500 nits of brightness for vibrant colors and incredible image detail.",
            "FaceTime HD camera with advanced image signal processor for clearer, sharper video calls."
        ],
    
    
        "specifications": [
            "Model Name - MacBook Air",
            "Brand - Apple",
            "Specific Uses For Product - Personal, Gaming, Business",
            "Screen Size - 13.3 Inches",
            "Operating System - Mac OS",
            "CPU Manufacturer -  Apple",
            "Graphics Card Description - Integrated",
            "Color - Silver",
            "Connectivity Technology - Bluetooth, Wi-Fi, USB",
            "Hard Disk Size - 256 GB"
        ],
        "options": {
            "capacity": [ "256 GB", "512 GB" ]
        },
    
    
        "description_images": [
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/V2-MacBook_Pro_13-in_Product_Page_L_M1_Chip_v2__en-US_01._CB415534499_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/V2-MacBook_Pro_13-in_Product_Page_L_M1_Chip_v2__en-US_02._CB415534499_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/V2-MacBook_Pro_13-in_Product_Page_L_M1_Chip_v2__en-US_03._CB415534499_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/V2-MacBook_Pro_13-in_Product_Page_L_M1_Chip_v2__en-US_04._CB415534499_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/V2-MacBook_Pro_13-in_Product_Page_L_M1_Chip_v2__en-US_05._CB415534499_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/V2-MacBook_Pro_13-in_Product_Page_L_M1_Chip_v2__en-US_06._CB415534499_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/V2-MacBook_Pro_13-in_Product_Page_L_M1_Chip_v2__en-US_07._CB415534499_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/V2-MacBook_Pro_13-in_Product_Page_L_M1_Chip_v2__en-US_08._CB415534499_.jpg",
            "https://m.media-amazon.com/images/G/01/appcore/laptop/nov2020npi/V2-MacBook_Pro_13-in_Product_Page_L_M1_Chip_v2__en-US_09._CB415534499_.jpg"
        ],
        "reviews": [
            {
                "title": "Best Laptop in History",
                "author": "JK Reviews",
                "rating": "5.0 of 5",
                "message": "I got my new MacBook Pro M1 two weeks ago and could not be more happy with it. This machine is absolutely incredible in terms of speed, looks, weight/size, display, and battery life - and texture (it feels so good against the skin on my wrists as I type) and basically anything else you can think of. I also love the space gray color, the new keyboard, the Touch Bar, and the larger trackpad. There are so many options to customize the system to work just the way I like.\nMy previous MacBook was the 2011 model and it still works today, but after 10 years it became too slow and the trackpad had trouble clicking, so after a TON of research, I decided to pull the trigger and get the New MacBook Pro with the M1 chip.\nA couple suggestions I am able to give after spending almost two months and probably over 30 hours researching the new MacBook are: go with the standard model of 8gb of RAM and the 256 ssd - you can get this on Amazon for $1239 vs $1299 at Apple - so you get to save 60 bucks, and you have the added satsfaction of not having to deal with the snobby nerd losers that work in the Apple Store, who asked me rudely when I went in to get a new laptop 'umm, do you have an appointment? Well, you're going to have to make an appointment if you want to go in the store'. I love Apple products and will never use another phone or computer besides the iPhone and MacBook, but after that experience I will never again give my business to the physical Apple Stores. I mean, seriously, do you really need me to make an appointment to buy a $1300 laptop? Whatever dude.\nAnyway, in several YouTube videos that compared the 8GB ram model along side the 16GB ram model (costs 200 bucks more), the 8GB performed just as well in nearly every task - and they really pushed it to the limits. The only reason to pay up for the 16GB RAM is if you want to edit 8K UHD videos or are a super serious music recording artist or highly advanced professional photographer - and even then it's not too much of a difference. For the every day user (me or baly anyone who is not a computer professional) the 8GB working with this new M1 chip is mind-blowing, blows any other laptop on the market completely out of the water, and actually even performs just as well as the $2200 15 inch MacBook Pro using the Intel chip. As far as the storage goes, 256 ssd is standard - that's what I got - and you can pay 200 bucks more for 512 ssd or 400 bucks more for 1 TB. But with the Cloud storage available now, you don't really need to keep much on the laptop drive, you can just save it to the cloud.\nOverall I honestly could go on for hours about every little detail that I absolutely love about this machine. A free one year subscription to Apple TV is also another little perk. But I am still mystified every day at how incredible this machine is. I've been online for over 3 hours now and its still on 92% battery. The new Retina display is brilliant. Everything is perfect. I truly am in love this laptop and would recommend that anyone looking for a new laptop to last a long time and outperform everything else on the market gets the new matchbook 13 inch M1."
            },
            {
                "title": "Amazing",
                "author": "Westmark Consulting",
                "rating": "5.0 of 5",
                "message": "I bought my Mac from Apple directly not from Amazon. This thing is amazing. Battery life is awesome. Hard to believe that I can work with it all day and do not have to charge at all even with bright screen.\n\nNo issues with speed at all. I use Matlab a lot and this computer is even slightly faster than my desktop with 12 core AMD CPU and 32 GB ram.\n\nExcellent machine. Happy I bought it."
            },
            {
                "title": "I love my Mac",
                "author": "Anscestor Hunter",
                "rating": "5.0 of 5",
                "message": "It's a Mac once you go Mac you never go back. This is my second Mac my first lasted almost 9 years."
            }
        ]
    }


]